'''
寻找水仙花数。

说明：水仙花数也被称为超完全数字不变数、自恋数、自幂数、阿姆斯特朗数，它是一个3位数，该数字每个位上数字的立方之和正好等于它本身，例如：$1^3 + 5^3+ 3^3=153$。

'''

for i in range(100, 1000):
    # 拿到 个位 十位  百位的数字
    # 101 / 100 / 10
    # 个位
    x = i % 100 % 10

    # 十位
    y = int(i % 100 / 10)

    # 百位
    z = int(i / 100)

    if (x ** 3) + (y ** 3) + (z ** 3) == i:
        print("%d 是水仙花数" % i)


for num in range(100, 1000):
    low = num % 10
    mid = num // 10 % 10
    high = num // 100
    if num == low ** 3 + mid ** 3 + high ** 3:
        print(num)
